---
kind: other
id: Methods.T:Autodesk.Revit.UI.ToggleButton
source: html/c5ac8795-5ab3-e51e-7ff7-c5848fdf0f14.htm
---
# ToggleButton Methods

Determines whether the specified Object is equal to the current Object .